In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv(r"D:\batch -3\Machine Learning\Model\online.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.shape

(50, 5)

In [4]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [5]:
# if missiong
# missing = df.Administration.mean()
# df.Administration = df.Administration.fillna(missing)


separate x,y

In [6]:
x = df.drop(['Profit'],axis=1)

In [7]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [8]:
y = df['Profit']

In [9]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64


One hot encoding

In [10]:
#convert the column into catergorical columns
city = pd.get_dummies(x['Area'],drop_first=True)

In [11]:
city.head()

   Dhaka  Rangpur
0   True    False
1  False    False
2  False     True
3   True    False
4  False     True

In [12]:
# Drop the Area column

x = x.drop('Area',axis=1)
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [13]:
# concatiation
x = pd.concat([x,city],axis=1)
x.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10   True    False
1        162597.70       151377.59  443898.53  False    False
2        153441.51       101145.55  407934.54  False     True
3        144372.41       118671.85  383199.62   True    False
4        142107.34        91391.77  366168.42  False     True

In [14]:
from sklearn.model_selection import train_test_split

xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.25,random_state=1)

from sklearn.linear_model import LinearRegression

reg = LinearRegression()

reg.fit(xtrain,ytrain)
xtest.head()

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
27         72107.60       127864.55  353183.81   True    False
35         46014.02        85047.44  205517.64   True    False
40         28754.33       118546.05  172795.67  False    False
38         20229.59        65947.93  185265.10   True    False
2         153441.51       101145.55  407934.54  False     True

In [15]:
xtrain.head()

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
36         28663.76       127056.21  201126.82  False     True
19         86419.70       153514.11       0.00   True    False
42         23640.93        96189.63  148001.11  False    False
49             0.00       116983.80   45173.06  False    False
26         75328.87       144135.98  134050.07  False     True

In [16]:
ytest.head()

27    105008.31
35     96479.51
40     78239.91
38     81229.06
2     191050.39
Name: Profit, dtype: float64

In [17]:
# predictin the Test set results
pred = reg.predict(xtest)
pred

array([128970.94931164,  94828.31285859,  81731.56746651,  75895.19562524,
       176099.90741867, 173273.75118269,  44515.20084462, 103041.30105485,
        77625.00002628,  98509.81855802,  90346.91052112,  84224.18281902,
       129815.7234491 ])

In [18]:
ytest.head()

27    105008.31
35     96479.51
40     78239.91
38     81229.06
2     191050.39
Name: Profit, dtype: float64

In [19]:
reg.score(xtest,ytest)

0.9047265530273867


R-Squared Value

In [20]:
from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error

score = r2_score(ytest,pred)
score

0.9047265530273867